using BigLion.Application.Common.Interfaces;
using BigLion.Application.Common.Security;
using BigLion.Domain.Entities;

namespace BigLion.Application.Features.Systems.Commands;
[Authorize(Policy = HealthCheckupPolicies.AllowAnonymous)]
public class RecommendationTemplateInitializerCommand : IRequest<Unit> { }
public class RecommendationTemplateInitializerCommandHandler
    : IRequestHandler<RecommendationTemplateInitializerCommand, Unit>
{
    private readonly ICheckupDatabaseContext _context;

    public RecommendationTemplateInitializerCommandHandler(ICheckupDatabaseContext checkupDatabaseContext)
    {
        _context = checkupDatabaseContext;
    }

    public async Task<Unit> Handle(RecommendationTemplateInitializerCommand request, CancellationToken cancellationToken)
    {
        if (await _context.RecommendationTemplates.AnyAsync(cancellationToken))
        {
            return Unit.Value;
        }

        var templates = new List<RecommendationTemplate>()
        {
            new ("ผลการตรวจสุขภาพครั้งนี้ไม่พบความผิดปกติ แนะนำตรวจสุขภาพประจำปีทุกปี"),
            new ("สุขภาพสมบูรณ์แข็งแรง"),
            new ("ตรวจพบความดันโลหิตสูง ควรหลีกเลี่ยง : อาหารแปรรูป อาหารหมักดอง อาหารที่มีรสชาติเค็มจัด เช่น ไส้กรอก ปลาร้า หมูยอ ปลากระป๋อง หลีกเลี่ยงการสูบบุหรี่และแอลกอฮอลล์  ควรรับประทานอาหารให้ครบ 5 หมู่ และออกกำลังกายเป็นประจำ"),
            new ("ตรวจพบน้ำตาลในเลือดสูง ควรหลีกเลี่ยง : ข้าวแป้งที่ซ้ำซ้อน เช่น เผือก มัน ฟักทอง ข้าวโพด และจำกัดปริมาณผลไม้ ควรรับประทานผลไม้น้ำตาลต่ำ 1-2 ผลต่อวัน เนื้อสัตว์อย่างน้อย 6-8 ช้อนกินข้าว/มื้อ และผักประเภทใบ 3-6 ทัพพี/วัน"),
            new ("ตรวจพบไขมันในเลือดสูง ควรหลีกเลี่ยง : น้ำมันไขมันอิ่มตัวสูง เช่น น้ำมันหมู น้ำมันปาล์ม น้ำมันมะพร้าว และกะทิ หลีกเลี่ยงเนื้อสัตว์ติดมัน แนะนำเนื้อสัตว์ไม่ติดมัน เช่น อกไก่ น้ำมันถั่วเหลือง น้ำมันมะกอก น้ำมันรำข้าว อะโวคาโด"),
            new ("ตรวจพบการทำงานของตับผิดปกติ ควรหลีกเลี่ยง : น้ำมันไขมันอิ่มตัวสูง เช่น น้ำมันหมู น้ำมันปาล์ม น้ำมันมะพร้าว และกะทิ หลีกเลี่ยงเนื้อสัตว์ติดมัน แนะนำเนื้อสัตว์ไม่ติดมัน  หลีกเลี่ยงเบเกอรี่/ขนมไทย  น้ำหวาน และผลไม้น้ำตาลสูงทุกชนิด"),
            new ("ตรวจพบการทำงานของไตผิดปกติ"),
            new ("ตรวจพบกรดยูริกสูง ควรหลีกเลี่ยง : สัตว์ปีก ผักตระกูลยอดและเมล็ดผักต่างๆ ถั่วทุกชนิด เช่น ธัญพืชต้ม นมถั่วเหลือง น้ำเต้าหู้ เครื่องในสัตว์ ปลาไม่มีเกล็ด น้ำซุปกระดูก/น้ำซุปก๋วยเตี๋ยว"),
            new ("ตรวจพบโลหิตจาง ควรรับประทาน : อาหารที่มีธาตุเหล็กสูง เช่น ผักใบเขียว อาหารประเภทเครื่องในสัตว์ เช่น  เลือดไก่/หมู ตับ  กินผลไม้ที่มีวิตามินซีสูงพร้อมมื้ออาหาร เพื่อเพิ่มการดูดซึมธาตุเหล็ก (แนะนำหลีกเลี่ยงการดื่มนมพร้อมมื้ออาหาร)"),
            new ("แนะนำออกกำลังกายอย่างต่อเนื่อง อย่างน้อยวันละ 30 นาที"),
            new ("แนะนำควบคุมอาหารที่มีไขมันสูง ควรรับประทาน : เนื้อสัตว์ไม่ติดมัน เช่น อกไก่ ไข่ขาว เนื้อปลา หมูสันใน เลือกน้ำมันถั่วเหลือง น้ำมันมะกอก น้ำมันรำข้าว อะโวคาโด  เมล็ดฟักทอง ดื่มนมขาดมันเนยหรือพร่องมันเนยแทนนมไขมันเต็มส่วน ดื่มนมจืดแทนนมหวาน "),
            new ("แนะนำการควบคุมน้ำหนัก ควรจำกัด : ปริมาณข้าวแป้งไม่เกินมื้อละ 2-3 ทัพพี เลือกข้าวกล้อง/ข้าวไรซ์เบอรี่  เลือกผลไม้น้ำตาลต่ำ  เลือกเนื้อสัตว์ไขมันต่ำอย่างน้อย 6-8 ช้อนกินข้าว/มื้อ เพิ่มผักประเภทใบ"),
            new ("แนะนำควบคุมอาหารโรคไตก่อนฟอก ควรจำกัด : ควรหลีกเลี่ยงข้าวที่ไม่ขัดสี ธัญพืช เช่น ข้าวกล้อง ข้าวไรซ์เบอรี่ ข้าวโอ๊ต หลีกเลี่ยงอาหารที่มีฟอสฟอรัสสูง เช่น ไข่แดง ถั่วเมล็ดแห้งทุกชนิด  แมลง  กบ  นมและผลิตภัณฑ์จากนม  หลีกเลี่ยงอาหารโพแทสเซียมสูง เช่น ผักที่มีสีแดง  เหลือง  ส้ม  เขียวเข้ม เช่น  เผือก มัน ฟักทอง แครอท มะเขือเทศ บร็อกโคลี่  หลีกเลี่ยงอาหารรสชาติเค็ม เช่น อาหารแปรรูป อาหารหมักดอง  จำกัดปริมาณเนื้อสัตว์ ไม่เกิน 3-4 ช้อนโต๊ะ/มื้อ หากรับประทานอาหารไม่ได้ แนะนำอาหารเสริมทางการแพทย์เพิ่มเติม เช่น Nepro LP, Once Renal"),
            new ("แนะนำการควบคุมอาหารโรคไตหลังฟอก ควรรับประทาน : ควรหลีกเลี่ยงข้าวที่ไม่ขัดสี ธัญพืช เช่น ข้าวกล้อง ข้าวไรซ์เบอรี่ ข้าวโอ๊ต หลีกเลี่ยงอาหารที่มีฟอสฟอรัสสูง เช่น ไข่แดง ถั่วเมล็ดแห้งทุกชนิด แมลง กบ นมและผลิตภัณฑ์จากนม หลีกเลี่ยงอาหารโพแทสเซียมสูง เช่น ผักที่มีสีแดง เหลือง ส้ม เขียวเข้ม เช่น เผือก มัน ฟักทอง แครอท มะเขือเทศ บร็อกโคลี่ หลีกเลี่ยงอาหารรสชาติเค็ม เช่น อาหารแปรรูป อาหารหมักดองหากรับประทาน ควรเพิ่มปริมาณเนื้อสัตว์ไม่น้อยกว่า  5-8  ช้อนโต๊ะ/มื้อ   หากรับประทานอาหารไม่ได้ แนะนำอาหารเสริมทางการแพทย์เพิ่มเติม เช่น  Nepro HP , Once Dialyze"),
            new ("น้ำหนักตัวเกินเกณฑ์มาตรฐาน แนะนำออกกำลังกายอย่างสม่ำเสมอ อย่างน้อยวันละ 30 นาที"),
            new ("ผลตรวจคลื่นหัวใจผิดปกติเล็กน้อย ถ้ามีอาการผิดปกติ เช่น เหนื่อยง่าย ใจสั่น หน้ามืด เจ็บแน่นหน้าอก แนะนำปรึกษาแพทย์"),
            new ("มีระดับไขมันคลอเรสเตอรอล  สูงเกินค่าปกติเล็กน้อย แนะนำหลีกเลี่ยงอาหารมันและออกกำลังกายสม่ำเสมอ"),
            new ("มีระดับไขมันไตรกลีเซอไรด์สูงเกินค่าปกติ แนะนำหลีกเลี่ยงอาหารมันและออกกำลังกายสม่ำเสมอ"),
            new ("มีค่า eosinophil ในเลือดสูงแนะนำให้กินยาถ่ายพยาธิ"),
            new ("ผลการตรวจคลื่นไฟฟ้าหัวใจผิดปกติ ควรรับการตรวจอัลตราซาวน์หัวใจ และพบแพทย์เฉพาะทางอายุรกรรมโรคหัวใจ"),
            new ("ปัสสาวะขุ่น มีเม็ดเลือดขาวในปัสสาวะ สงสัยการติดเชื้อ หากมีอาการผิดปกติควรตรวจซ้ำ"),
            new ("ไขมันคอเลสเตอรอลและคอเลสเตอรอลตัวเลวในเลือดสูง แนะนำควบคุมอาหารจำพวกไขมันจากสัตว์ โดยเฉพาะตับ ไต หัวใจ ไข่แดง  เลี่ยงอาหารที่หมักยีสต์ เลี่ยงการทานอาหารปริมาณมากๆเกินจำเป็นบางมื้อ ออกกำลังกาย "),
            new ("กรดยูริคในเลือดสูง แนะนำควบคุมอาหารจำพวกสัตว์ปีกโดยเฉพาะเครื่องในสัตว์ปีก เนื้อแดง ยอดผัก เช่น ชะอม กระถิน ยอดฟักทอง หน่อไม้ ฝักกระเจี๊ยบ ไส้ในของแตงกวา งดเครื่องดื่มแอลกอฮอล์"),
            new ("มีภาวะโลหิตจางเล็กน้อย แนะนำรับประทานอาหารที่มีธาตุเหล็กมากขึ้น เช่น ถั่วชนิดต่าง ๆ ฟักทอง มะเขือพวง มะเขือเทศ ปลา ไข่ ตับ เป็นต้น"),
            new ("มีภาวะกระดูกบาง ควรรับประทานอาหารที่มีแคลเซี่ยมมากขึ้น เช่น นม ธัญพืช ถั่วชนิดต่าง ๆ และควรออกกำลังกายอย่างสม่ำเสมอ"),
            new ("ตรวจปัสสาวะไม่พบสารแอมเฟตามีน"),
            new ("ผลตรวจตาบอดสีปกติ"),
            new ("ผลตรวจเพาะเชื้ออุจจาระปกติ"),
            new ("ผลตรวจการได้ยินปกติ"),
            new ("ผลตรวจเอกซเรย์ทรวงอกปกติ"),


        };

        await _context.RecommendationTemplates.AddRangeAsync(templates, cancellationToken);
        await _context.SaveChangesAsync(cancellationToken);

        return Unit.Value;
    }
}
